from core.analyzer import ShingleAnalyzer

def run_manual_unit_tests():
    analyzer = ShingleAnalyzer(shingle_size=2)
    
    print("--- 2.3 ТЕСТУВАННЯ КОРЕКТНОСТІ НА КОНТРОЛЬНИХ ПРИКЛАДАХ ---")
    
    t1 = "алгоритм обробляє текст для пошуку плагіату"
    t2 = "алгоритм обробляє текст для пошуку плагіату"
    res1 = analyzer.analyze(t1, t2)
    print(f"ТЕСТ 1 (Ідентичні)")
    print(f"Текст 1: {t1}")
    print(f"Текст 2: {t2}")
    print(f"Очікувано: 100.0% | Отримано: {res1:.1f}%\n")

    t3 = "алгоритм виконує обробку текстових даних для аналізу"
    t4 = "алгоритм виконує аналіз текстових даних для перевірки"
    res2 = analyzer.analyze(t3, t4)
    print(f"ТЕСТ 2 (Часткова схожість)")
    print(f"Текст 1: {t3}")
    print(f"Текст 2: {t4}")
    print(f"Очікувано: 25% | Отримано: {res2:.2f}%\n")

    t5 = "алгоритм працює з текстом для виявлення плагіату"
    t6 = "база даних зберігає інформацію про користувачів системи"
    res3 = analyzer.analyze(t5, t6)
    print(f"ТЕСТ 3 (Різні)")
    print(f"Текст 1: {t5}")
    print(f"Текст 2: {t6}")
    print(f"Очікувано: 0.0% | Отримано: {res3:.1f}%")